Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ХозяйственныеОперации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеТоваровПоТребованию</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЧерезКомиссионера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаУПоставщика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаУПоставщикаРеглУчет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаПоИмпорту</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуРеглУчет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтРозничногоПокупателя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровЧерезКомиссионера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтКлиента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтХранителя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийКорректировкиНазначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыОперацийКорректировкиНазначения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СнятьРезерв</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятьРезервПоМногимНазначениям</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервироватьИКорректировать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резервировать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяКорректировкаНазначений</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>РасходныйОрдерНаТовары</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыПоРаспоряжениям</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>гф_КонтрагентПолучатель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещенийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>гф_ТоварыВКоробах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDКороба</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПар</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>гф_ШтрихкодыУпаковок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/гф_СнятиеРезерва/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры обеспечения формирования документов по снятию резерва.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// #wortmann {
// #Автоматическое формирование документов
// описание вставки
// Галфинд Volkov 2022/08/23
//
// Осуществляет заполненнение данных документа.
//
// Параметры:
//   Источник - ДокументОбъект - Обрабатываемый объект.
//   Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//   РежимПроведения - - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура гф_РасходныйОрдерНаТоварыПроведение(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению 
		И Источник.Получатель.гф_АгентскийСклад
		И Источник.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.НомерСтроки КАК НомерСтроки,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество КАК Количество
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.НомерСтроки,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.СтатусУказанияСерий,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество";
		
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеДокументаРасходныйОрдер = РезультатЗапроса.Выгрузить();
		ДанныеДокументаРасходныйОрдер.Колонки.Добавить("Номер");
		ДанныеДокументаРасходныйОрдер.Колонки.Добавить("ОтметкаОбработки");
		ДанныеДокументаРасходныйОрдер.Колонки.Добавить("ОтметкаОбработкиКорректировка");
		Номер = 0;
		Для каждого Строка Из ДанныеДокументаРасходныйОрдер Цикл
		   Строка.ОтметкаОбработки = Ложь;
		   Строка.ОтметкаОбработкиКорректировка = Ложь;
		КонецЦикла;
		
		ТоварыПоРаспоряжениям = Новый ТаблицаЗначений;
		ТоварыПоРаспоряжениям = ДанныеДокументаРасходныйОрдер.Скопировать();
		
		ТоварыПоРаспоряжениямКорректировка = Новый ТаблицаЗначений;
		ТоварыПоРаспоряжениямКорректировка = ДанныеДокументаРасходныйОрдер.Скопировать();
		
		Для Каждого Строка Из ДанныеДокументаРасходныйОрдер Цикл
			
			// ПеремещениеТоваров
			Если Строка.ОтметкаОбработки = Ложь Тогда
				
				ДокументОснование = ПолучитьДокументОснованиеПеремещение(Источник.Ссылка, Строка.Распоряжение);
				
				Если ДокументОснование = Неопределено Тогда
					ДокументПеремещениеТоваров = Документы.ПеремещениеТоваров.СоздатьДокумент();
				Иначе	
					ДокументПеремещениеТоваров = ДокументОснование.ПолучитьОбъект();
				КонецЕсли;	
				
				ДокументПеремещениеТоваров.Дата 					= Источник.Дата;
				ДокументПеремещениеТоваров.Организация 				= Строка.Распоряжение.Организация;
				ДокументПеремещениеТоваров.СкладОтправитель 		= Источник.Склад;
				ДокументПеремещениеТоваров.СкладПолучатель 			= Источник.Получатель;
				ДокументПеремещениеТоваров.ЗаказНаПеремещение 		= Строка.Распоряжение;
				ДокументПеремещениеТоваров.ПеремещениеПоЗаказам 	= Истина;
				ДокументПеремещениеТоваров.ДокументОснование 		= Источник.Ссылка;
				ДокументПеремещениеТоваров.Ответственный 			= Источник.Ответственный;
				ДокументПеремещениеТоваров.Автор 					= Источник.Ответственный;
				ДокументПеремещениеТоваров.Статус 					= Перечисления.СтатусыПеремещенийТоваров.Принято;
				ДокументПеремещениеТоваров.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
				ДокументПеремещениеТоваров.СпособДоставки 			= Перечисления.СпособыДоставки.Самовывоз;
				ДокументПеремещениеТоваров.ВариантПриемкиТоваров 	= Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
				
				НайденнаяСтрока = ТоварыПоРаспоряжениям.Найти(Строка.НомерСтроки, "НомерСтроки");
				Если НайденнаяСтрока <> Неопределено Тогда
					НайденнаяСтрока.ОтметкаОбработки = Истина;
					ТоварыПоРаспоряжениям.Удалить(ТоварыПоРаспоряжениям.Индекс(НайденнаяСтрока));
				КонецЕсли;
				
				ДокументПеремещениеТоваров.Товары.Очистить();
				НоваяСтрока = ДокументПеремещениеТоваров.Товары.Добавить();
				НоваяСтрока.Номенклатура 			= Строка.Номенклатура;
				НоваяСтрока.Характеристика 			= Строка.Характеристика;
				НоваяСтрока.Серия 					= Строка.Серия;
				НоваяСтрока.Назначение 				= Строка.Назначение;
				НоваяСтрока.Количество 				= Строка.Количество;
				НоваяСтрока.КоличествоУпаковок 		= Строка.Количество;
				
				Для каждого Строка2 Из ТоварыПоРаспоряжениям Цикл
					
					Если Строка2.ОтметкаОбработки = Ложь И Строка.Распоряжение = Строка2.Распоряжение и Не Строка.НомерСтроки = Строка2.НомерСтроки Тогда
						НоваяСтрока = ДокументПеремещениеТоваров.Товары.Добавить();
						НоваяСтрока.Номенклатура 			= Строка2.Номенклатура;
						НоваяСтрока.Характеристика 			= Строка2.Характеристика;
						НоваяСтрока.Серия 					= Строка2.Серия;
						НоваяСтрока.Назначение 				= Строка2.Назначение;
						НоваяСтрока.Количество 				= Строка2.Количество;
						НоваяСтрока.КоличествоУпаковок 		= Строка2.Количество;
						
						Строка2.ОтметкаОбработки = Истина;
						
						НайденнаяСтрока = ДанныеДокументаРасходныйОрдер.Найти(Строка2.НомерСтроки, "НомерСтроки");
						Если НайденнаяСтрока <> Неопределено Тогда
							НайденнаяСтрока.ОтметкаОбработки = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Строка.ОтметкаОбработки = Истина;
				ДокументПеремещениеТоваров.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
				ДокументПеремещениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			// КорректировкаНазначенияТоваров
			
			Если Строка.ОтметкаОбработкиКорректировка = Ложь Тогда
				
				ДокументОснованиеКорректировка = ПолучитьДокументОснованиеКорректировка(Источник.Ссылка, Строка.Назначение);
				
				Если ДокументОснованиеКорректировка = Неопределено Тогда
					ДокументКорректировка = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
				Иначе	
					ДокументКорректировка = ДокументОснованиеКорректировка.ПолучитьОбъект();
				КонецЕсли;	
				
				ДокументКорректировка.Дата 					= Источник.Дата;
				ДокументКорректировка.Организация 			= Строка.Распоряжение.Организация;
				ДокументКорректировка.ВидОперации 			= Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
				ДокументКорректировка.ДокументОснование 	= Источник.Ссылка;
				ДокументКорректировка.Ответственный 		= Источник.Ответственный;
				ДокументКорректировка.Автор 				= Источник.Ответственный;
				ДокументКорректировка.Назначение 			= Строка.Назначение;
				
				НайденнаяСтрока = ТоварыПоРаспоряжениямКорректировка.Найти(Строка.НомерСтроки, "НомерСтроки");
				Если НайденнаяСтрока <> Неопределено Тогда
					НайденнаяСтрока.ОтметкаОбработкиКорректировка = Истина;
					ТоварыПоРаспоряжениямКорректировка.Удалить(ТоварыПоРаспоряжениямКорректировка.Индекс(НайденнаяСтрока));
				КонецЕсли;
				
				ДокументКорректировка.Товары.Очистить();
				НоваяСтрока = ДокументКорректировка.Товары.Добавить();
				НоваяСтрока.Номенклатура 			= Строка.Номенклатура;
				НоваяСтрока.Характеристика 			= Строка.Характеристика;
				НоваяСтрока.Серия 					= Строка.Серия;
				НоваяСтрока.Количество 				= Строка.Количество;
				НоваяСтрока.КоличествоУпаковок 		= Строка.Количество;
				НоваяСтрока.Склад 					= Источник.Получатель;
				НоваяСтрока.ИсходноеНазначение 		= Строка.Назначение;
				
				Для каждого Строка2 Из ТоварыПоРаспоряжениямКорректировка Цикл
					
					Если Строка2.ОтметкаОбработкиКорректировка = Ложь И Строка.Назначение = Строка2.Назначение и Не Строка.НомерСтроки = Строка2.НомерСтроки Тогда
						НоваяСтрока = ДокументКорректировка.Товары.Добавить();
						НоваяСтрока.Номенклатура 			= Строка2.Номенклатура;
						НоваяСтрока.Характеристика 			= Строка2.Характеристика;
						НоваяСтрока.Серия 					= Строка2.Серия;
						НоваяСтрока.Количество 				= Строка2.Количество;
						НоваяСтрока.КоличествоУпаковок 		= Строка2.Количество;
						НоваяСтрока.Склад 					= Источник.Получатель;
						НоваяСтрока.ИсходноеНазначение 		= Строка.Назначение;
						
						Строка2.ОтметкаОбработкиКорректировка = Истина;
						
						НайденнаяСтрока = ДанныеДокументаРасходныйОрдер.Найти(Строка2.НомерСтроки, "НомерСтроки");
						Если НайденнаяСтрока <> Неопределено Тогда
							НайденнаяСтрока.ОтметкаОбработкиКорректировка = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Строка.ОтметкаОбработкиКорректировка = Истина;
				ДокументКорректировка.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
				ДокументКорректировка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

// Осуществляет заполненнение данных документа.
//
// Параметры:
//   Источник - ДокументОбъект - Обрабатываемый объект.
//   Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//   РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа.
//					Позволяет определить в теле процедуры режим записи.
//   РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура гф_РасходныйОрдерНаТоварыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаНазначенияТоваров.Ссылка КАК Ссылка,
		|	КорректировкаНазначенияТоваров.ДокументОснование КАК ДокументОснование,
		|	КорректировкаНазначенияТоваров.Назначение КАК Назначение
		|ИЗ
		|	Документ.КорректировкаНазначенияТоваров КАК КорректировкаНазначенияТоваров
		|ГДЕ
		|	КорректировкаНазначенияТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			Если Источник.ПометкаУдаления Тогда
				Документ.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
				Документ.УстановитьПометкуУдаления(Истина);
			Иначе
				Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
				
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
		|	ПеремещениеТоваров.ДокументОснование КАК ДокументОснование,
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
			
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			Если Источник.ПометкаУдаления Тогда
				Документ.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
				Документ.УстановитьПометкуУдаления(Истина);
			Иначе
				Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись И Источник.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаНазначенияТоваров.Ссылка КАК Ссылка,
		|	КорректировкаНазначенияТоваров.ДокументОснование КАК ДокументОснование,
		|	КорректировкаНазначенияТоваров.Назначение КАК Назначение
		|ИЗ
		|	Документ.КорректировкаНазначенияТоваров КАК КорректировкаНазначенияТоваров
		|ГДЕ
		|	КорректировкаНазначенияТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
			Документ.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
		|	ПеремещениеТоваров.ДокументОснование КАК ДокументОснование,
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
			Документ.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ Источник.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаНазначенияТоваров.Ссылка КАК Ссылка,
		|	КорректировкаНазначенияТоваров.ДокументОснование КАК ДокументОснование,
		|	КорректировкаНазначенияТоваров.Назначение КАК Назначение
		|ИЗ
		|	Документ.КорректировкаНазначенияТоваров КАК КорректировкаНазначенияТоваров
		|ГДЕ
		|	КорректировкаНазначенияТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
			Документ.УстановитьПометкуУдаления(Ложь);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
		|	ПеремещениеТоваров.ДокументОснование КАК ДокументОснование,
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.ДополнительныеСвойства.Вставить("ДокументОснование", Истина);
			Документ.УстановитьПометкуУдаления(Ложь);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументОснованиеПеремещение(Источник, Распоряжение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|	ПеремещениеТоваров.ДокументОснование КАК ДокументОснование,
	|	ПеремещениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.ЗаказНаПеремещение = &ЗаказНаПеремещение
	|	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник);
	Запрос.УстановитьПараметр("ЗаказНаПеремещение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДокументОснованиеКорректировка(Источник, Назначение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаНазначенияТоваров.Ссылка КАК Ссылка,
		|	КорректировкаНазначенияТоваров.ДокументОснование КАК ДокументОснование,
		|	КорректировкаНазначенияТоваров.Назначение КАК Назначение
		|ИЗ
		|	Документ.КорректировкаНазначенияТоваров КАК КорректировкаНазначенияТоваров
		|ГДЕ
		|	КорректировкаНазначенияТоваров.ДокументОснование = &ДокументОснование
		|	И КорректировкаНазначенияТоваров.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
